// API চেকলিস্ট 

// ১. একদম প্রাথমিক স্টেপ হিসেবে jsonplaceholder এর ওয়েবসাইট থেকে ডাটা fetch করে সেটাকে কনসোল এ দেখাতে হবে। ধরো তুমি তাদের ওয়েবসাইট এ comments এর API এর লিংক কোনটা সেটা জাভাস্ক্রিপ্ট দিয়ে কোড করে সেই ডাটা কনসোল এ দেখতে পারতেছো কিনা। 

/* function loadComments()
{
    fetch('https://jsonplaceholder.typicode.com/comments')
    .then(res=>res.json())
    .then(data=>console.log(data))
} */
const loadComments=()=>{

    fetch('https://jsonplaceholder.typicode.com/comments')
    .then(res=>res.json())
    .then(data=>displayComments(data))

}
// loadComments();

//  const displayComments=data=>{
//     const ul=document.getElementById('users')
//     for(const user of data)
//     {
//         const li=document.createElement('li');
//         li.innerText=`Name: ${user.name} , Email: ${user.email}`
//         ul.appendChild(li)
//     }
// } 
const displayComments=data=>{

    const ul=document.getElementById('users')
    data.forEach(user=>
        {
            const li=document.createElement('li');
            li.innerText=`Name: ${user.name} , Email: ${user.email}`
            ul.appendChild(li)
        
    })
    
} 




// ২. যে কমেন্ট এর ডাটাগুলো কনসোল এ দেখাতে পারছো। সেগুলা আবার তুমি html এ দেখাতে পারতেছো কিনা। একটা সিস্টেম হবে তোমার একটা বাটন। থাকবে সেটাতে ক্লিক করলে ডাটা লোড হবে। তারপর সেই ডাটা তুমি ওয়েবসাইট এ দেখাবে। 

// ৩. আরেকটা সিস্টেম হবে। তুমি যে ডাটা লোড করেছো। সেটা কোন বাটনে ক্লিক করা লাগবে না। ওয়েবসাইট লোড হলেই সরাসরি ডাটা লোড হয়ে তারপর সেই ডাটা ওয়েবসাইট এ দেখাবে। চেষ্টা করবে লোড করা ডাটা এর দুইটা প্রপার্টি অবশ্যই দেখাবে। 

// ৪. তুমি যে ডাটা লোড করেছো। বা ডাটা ওয়েবসাইট এ দেখাচ্ছ। সেই কোড এর মধ্যে arrow ফাংশন ইউজ করতে পারতেছো কিনা। যখন লুপ চালাচ্ছ সেখানে forEach ইউজ করতে পারতেছো কিনা। 
// ৫. ডাইনামিক ডাটা লোড। কোন একটা কমেন্ট এ ক্লিক করলে (কমেন্ট এর div এ বা কোন একটা বাটন এ )সেই কমেন্ট এর আইডি নিয়ে সেটা api এর url এ বসিয়ে (ডাইনামিকভাবে টেমপ্লেট স্ট্রিং দিয়ে) সেই ডাটা লোড করে। সেই ডাটা ওয়েবসাইট এ দেখাতে পারতেছো কিনা। 



// ৬. randomuser এর ওয়েবসাইট এ গিয়ে (randomuser.me) এ গিয়ে সেখান থেকে ডাটা লোড করবে। তারপর ইউজারের ছবি দেখাবে। শুধু সেটাও না। ইউজারের location এর মধ্যে যত কিছু আছে। সব দেখাবে ওয়েবসাইট এ। অর্থাৎ street, city, coordinates, timezone যেকোন একভাবে দেখলেই হবে। তবে দেখাতে হবে। 



// ৭. network ট্যাব একটু ভালো করে দেখো। দরকার হলে। গুগলে সার্চ দিয়ে বা ইউটিউবে ভিডিও দেখে ফেলো। এখন বেশিরভাগ জিনিস বুঝতে না পারলেও দেখে ফেলো। ফিউচারে কাজে লাগবে। 



// ৮. সিরিয়াস প্রাকটিস the meal db এর খালতো ভাই the sports db থেকে কিছু জিনিস এনে দেখাবে। একজাক্টলি কি দেখাতে হবে। সেটা আমি বলে দিবো না। তুমি ওদের ওয়েবসাইট এ যাও। সেখানে কি কি লেখা আছে সেগুলা পড়ো। api গুলা এর ছোট করে কি কি করে বলা আছে। সেগুলা দেখো। তারপর কিছু ডাটা লোড করো। সেই ডাটাগুলো দেখাও। এইখানে সার্চ ফাংশনালিটি ইমপ্লিমেন্ট করো। অনেকটা mealdb এর মতো। আবার কোন একটাতে ক্লিক করলে সেটার ডিটেল দেখাবে। 

// ৯. চ্যালেঞ্জ দেখো sports db এর জন্য যে ওয়েবসাইট বানাবে সেখানে একটা লোডিং স্পিনার যোগ করতে পারো কিনা। জিনিসটা একটু কঠিন মনে হতে পারে। তাও দেখানোর চেষ্টা করো। এইটা আমরা এক সময় দেখিয়ে দেব। তবে তার আগে তুমি দেখো গুগলে সার্চ দিয়ে কিছু বের করতে পারো কিনা।  

// ১০. চ্যালেঞ্জ (আগামীকাল এর চ্যালেঞ্জ। যদিও আজকের ভিডিওতে বলে দিয়েছি)তুমি নিজে নিজে temperature দেখানোর একটা API ইউজ করে কিছু একটা করার বা শেখার চেষ্টা করে ফেলতে পারো। আমি ভিডিওতে openweathermap এর কথা বলেছি। সেই ওয়েবসাইট ইউজ করার সিস্টেম নিজে নিজে খুঁজে বের করো। সেখানে একটা API KEY লাগবে। সেটা কিভাবে পেতে হয় আমরা বলে দিবো না। তুমি তাদের ওয়েবসাইট ঘেঁটে বের করো। জিনিসটা সিম্পল। তারপরেও নিজে নিজে খুঁজে বের করার চেষ্টা করা অনেক বেশি গুরুত্বপূর্ণ। তারপর এমন একটা ওয়েবসাইট বানিয়ে ফেলো যেখানে কোন শহরের নাম লিখলে সেখানকার তাপমাত্রা কত বলে দিবে। এই রিলেটেড ডিজাইন এর একটা রিপো আছে আমাদের গিটহাব এ। সেই রিপো এর নাম temperature hot তবে তোমাকে সেই ডিজাইন করতেই হবে। এমন কোন কথা নাই। বরং তুমি তোমার মতো করে ডিজাইন করবে। 
